Revit 2024 API
Document.Print Method
Prints a set of views.
Overload List
Name | Description
Print(ViewSet)
Prints a set of views with default view template and default print settings.
Print(ViewSet, View)
Prints a set of views with a specified view template and default print settings.
Print(ViewSet, Boolean)
Prints a set of views with default view template and default print settings.
Print(ViewSet, View, Boolean)
Prints a set of views with a specified view template and default print settings.
See Also
Document Class
Document Members
Autodesk.Revit.DB Namespace